src/Documents/ЭлектронныйДокументВходящий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЭлектронныйДокументВходящий</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияРегламентаЭДО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииРегламентаОбмена1С</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаОтправителя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияСостоянияЭДО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДокументаОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияОбИспользованииЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииЭД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильНастроекЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиНастроекЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прочитан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЭДО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВерсийЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭлементаВерсииЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовВерсииЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяИзвещение</Name>
					<Comment>Требуется извещение от получателя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
					<Comment>Требуется подпись получателя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаОзнакомлении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОснование</Name>
					<Comment>Флаг для выборки ЭД в раздел "ОтразитьВУчете" обработки "ТекущиеДелаЭДО"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Comment>Без учета исправления</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитДанныеОМаркируемыхТоварах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящий</v8:Type>
								<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящий</v8:Type>
								<v8:Type>cfg:DocumentRef.УдалитьПроизвольныйЭД</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ПакетЭД</v8:Type>
								<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиКонтрагентов</v8:Type>
								<v8:Type>cfg:DocumentRef.ЭлектронныйПутевойЛист</v8:Type>
								<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиОрганизаций</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
								<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
								<v8:Type>cfg:DocumentRef.УдалитьЭлектронныйДокументВходящий</v8:Type>
								<v8:Type>cfg:DocumentRef.ЭлектроннаяТранспортнаяНакладная</v8:Type>
								<v8:Type>cfg:CatalogRef.СоглашенияОбИспользованииЭД</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
								<v8:Type>cfg:DocumentRef.УдалитьЭлектронныйДокументИсходящий</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИдентификаторыОснованийВладельцаФайла</Name>
					<Comment>Хранит уникальные идентификаторы документов оснований (документы информационной базы на основании которых введен Владелец файла в базе инициатора ЭДО) и признак необходимости связки основания и потомка</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторДокументаОснования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЭДДокументаОснования</Name>
							<Comment>Идентификатор электронного документа, у которого документ-основание указан в реквизите Владелец файла</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ВидыЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктВыполненныхРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктЗаказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктИсполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктНаПередачуПрав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпискаБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНочнойВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОПолучении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квитанция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйСчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПродажахКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОСписанииКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрайсЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбИзмененииСтоимостиОтправитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбИзмененииСтоимостиПолучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТОРГ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТОРГ12Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТОРГ12Продавец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбУточнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредложениеОбАннулировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОРасхождениях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прикладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиночитаемаяДоверенность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверкиВзаиморасчетов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЭлектронныйДокументВходящий/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызывается непосредственно до записи объекта в базу данных
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОснование = ДокументыОснования.Количество();
	
	Если ЭтотОбъект.ЭтоНовый() Тогда
				
		Если ЭтотОбъект.ВидЭД = Перечисления.ВидыЭД.ПроизвольныйЭД Тогда
			Если Не ЗначениеЗаполнено(НаименованиеДокументаОтправителя) Тогда
				НаименованиеДокументаОтправителя = ЭтотОбъект.ТипДокумента;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ДатаДокументаОтправителя) Тогда
				ДатаДокументаОтправителя = НачалоДня(Дата);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(НомерДокументаОтправителя) Тогда
				НомерДокументаОтправителя = Номер;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
